Microchip-MPLAB-Harmony/dev_packs/Microchip/SAML22_DFP/3.4.59/atdf/ATSAML22J17A.atdf
        <module name="DMAC" id="U2223" version="2.2.2">
          <instance name="DMAC">
            <register-group name="DMAC" name-in-module="DMAC" address-space="base" offset="0x41008000"/>
            <parameters>
              <param name="CH_BITS" value="4" caption="Number of bits to select channel"/>
              <param name="CH_NUM" value="16" caption="Number of channels"/>
              <param name="EVIN_NUM" value="4" caption="Number of input events"/>
              <param name="EVOUT_NUM" value="4" caption="Number of output events"/>
              <param name="LVL_BITS" value="2" caption="Number of bit to select level priority"/>
              <param name="LVL_NUM" value="4" caption="Enable priority level number"/>
              <param name="QOSCTRL_D_RESETVALUE" value="2" caption="QOS dmac ahb interface reset value"/>
              <param name="QOSCTRL_F_RESETVALUE" value="2" caption="QOS dmac fetch interface reset value"/>
              <param name="QOSCTRL_WRB_RESETVALUE" value="2" caption="QOS dmac write back interface reset value"/>
              <param name="TRIG_BITS" value="6" caption="Number of bits to select trigger source"/>
              <param name="TRIG_NUM" value="40" caption="Number of peripheral triggers"/>
              <param name="INSTANCE_ID" value="36"/>
            </parameters>
          </instance>
        </module>
        <module name="DSU" id="U2209" version="2.5.0.1">
          <instance name="DSU">
            <register-group name="DSU" name-in-module="DSU" address-space="base" offset="0x41002000"/>
            <parameters>
              <param name="INSTANCE_ID" value="33"/>
            </parameters>
          </instance>
        </module>
        <module name="EIC" id="U2254" version="2.0.2">
          <instance name="EIC">
            <register-group name="EIC" name-in-module="EIC" address-space="base" offset="0x40002800"/>
            <signals>
              <signal group="EXTINT" index="0" function="A" pad="PA16"/>
              <signal group="EXTINT" index="0" function="A" pad="PB00"/>
              <signal group="EXTINT" index="0" function="A" pad="PB16"/>
              <signal group="EXTINT" index="0" function="A" pad="PA00"/>
              <signal group="EXTINT" index="1" function="A" pad="PA17"/>
              <signal group="EXTINT" index="1" function="A" pad="PB01"/>
              <signal group="EXTINT" index="1" function="A" pad="PB17"/>
              <signal group="EXTINT" index="1" function="A" pad="PA01"/>
              <signal group="EXTINT" index="2" function="A" pad="PA02"/>
              <signal group="EXTINT" index="2" function="A" pad="PA18"/>
              <signal group="EXTINT" index="2" function="A" pad="PB02"/>
              <signal group="EXTINT" index="3" function="A" pad="PA03"/>
              <signal group="EXTINT" index="3" function="A" pad="PA19"/>
              <signal group="EXTINT" index="3" function="A" pad="PB03"/>
              <signal group="EXTINT" index="4" function="A" pad="PA04"/>
              <signal group="EXTINT" index="4" function="A" pad="PA20"/>
              <signal group="EXTINT" index="4" function="A" pad="PB04"/>
              <signal group="EXTINT" index="5" function="A" pad="PA05"/>
              <signal group="EXTINT" index="5" function="A" pad="PA21"/>
              <signal group="EXTINT" index="5" function="A" pad="PB05"/>
              <signal group="EXTINT" index="6" function="A" pad="PA06"/>
              <signal group="EXTINT" index="6" function="A" pad="PA22"/>
              <signal group="EXTINT" index="6" function="A" pad="PB06"/>
              <signal group="EXTINT" index="6" function="A" pad="PB22"/>
              <signal group="EXTINT" index="7" function="A" pad="PA07"/>
              <signal group="EXTINT" index="7" function="A" pad="PA23"/>
              <signal group="EXTINT" index="7" function="A" pad="PB07"/>
              <signal group="EXTINT" index="7" function="A" pad="PB23"/>
              <signal group="EXTINT" index="8" function="A" pad="PB08"/>
              <signal group="EXTINT" index="9" function="A" pad="PA09"/>
              <signal group="EXTINT" index="9" function="A" pad="PB09"/>
              <signal group="EXTINT" index="10" function="A" pad="PA10"/>
              <signal group="EXTINT" index="10" function="A" pad="PA30"/>
              <signal group="EXTINT" index="11" function="A" pad="PA11"/>
              <signal group="EXTINT" index="11" function="A" pad="PA31"/>
              <signal group="EXTINT" index="11" function="A" pad="PB11"/>
              <signal group="EXTINT" index="12" function="A" pad="PA12"/>
              <signal group="EXTINT" index="12" function="A" pad="PA24"/>
              <signal group="EXTINT" index="12" function="A" pad="PB12"/>
              <signal group="EXTINT" index="13" function="A" pad="PA13"/>
              <signal group="EXTINT" index="13" function="A" pad="PA25"/>
              <signal group="EXTINT" index="13" function="A" pad="PB13"/>
              <signal group="EXTINT" index="14" function="A" pad="PB14"/>
              <signal group="EXTINT" index="14" function="A" pad="PB30"/>
              <signal group="EXTINT" index="14" function="A" pad="PA14"/>
              <signal group="EXTINT" index="15" function="A" pad="PA27"/>
              <signal group="EXTINT" index="15" function="A" pad="PB15"/>
              <signal group="EXTINT" index="15" function="A" pad="PB31"/>
              <signal group="EXTINT" index="15" function="A" pad="PA15"/>
              <signal group="NMI" function="A" pad="PA08"/>
            </signals>
            <parameters>
              <param name="EXTINT_NUM" value="16"/>
              <param name="GCLK_ID" value="3"/>
              <param name="NUMBER_OF_CONFIG_REGS" value="2"/>
              <param name="NUMBER_OF_INTERRUPTS" value="16"/>
              <param name="INSTANCE_ID" value="10"/>
            </parameters>
          </instance>
        </module>
        <module name="EVSYS" id="U2256" version="1.0.1">
          <instance name="EVSYS">
            <register-group name="EVSYS" name-in-module="EVSYS" address-space="base" offset="0x42000000"/>
            <parameters>
              <param name="CHANNELS" value="8" caption="Number of Channels"/>
              <param name="CHANNELS_BITS" value="3" caption="Number of bits to select Channel"/>
              <param name="CHANNELS_MSB" value="7" caption="Number of Channels - 1"/>
              <param name="EXTEVT_NUM" value="0" caption="Number of External Event Generators"/>
              <param name="GCLK_ID_0" value="7" caption="Index of Generic Clock 0"/>
              <param name="GCLK_ID_1" value="8" caption="Index of Generic Clock 1"/>
              <param name="GCLK_ID_2" value="9" caption="Index of Generic Clock 2"/>
              <param name="GCLK_ID_3" value="10" caption="Index of Generic Clock 3"/>
              <param name="GCLK_ID_4" value="11" caption="Index of Generic Clock 4"/>
              <param name="GCLK_ID_5" value="12" caption="Index of Generic Clock 5"/>
              <param name="GCLK_ID_6" value="13" caption="Index of Generic Clock 6"/>
              <param name="GCLK_ID_7" value="14" caption="Index of Generic Clock 7"/>
              <param name="GENERATORS" value="71" caption="Total Number of Event Generators"/>
              <param name="GENERATORS_BITS" value="7" caption="Number of bits to select Event Generator"/>
              <param name="USERS" value="31" caption="Total Number of Event Users"/>
              <param name="USERS_BITS" value="5" caption="Number of bits to select Event User"/>
              <param name="INSTANCE_ID" value="64"/>
            </parameters>
          </instance>
        </module>
        <module name="FREQM" id="U2257" version="1.0.1">
          <instance name="FREQM">
            <register-group name="FREQM" name-in-module="FREQM" address-space="base" offset="0x40002C00"/>
            <parameters>
              <param name="GCLK_ID_MSR" value="4" caption="Index of measure generic clock"/>
              <param name="GCLK_ID_REF" value="5" caption="Index of reference generic clock"/>
              <param name="INSTANCE_ID" value="11"/>
            </parameters>
          </instance>
        </module>
        <module name="GCLK" id="U2122" version="1.1.1">
          <instance name="GCLK">
            <register-group name="GCLK" name-in-module="GCLK" address-space="base" offset="0x40001C00"/>
            <signals>
              <signal group="IO" index="0" function="H" pad="PB14"/>
              <signal group="IO" index="0" function="H" pad="PB22"/>
              <signal group="IO" index="0" function="H" pad="PA14"/>
              <signal group="IO" index="0" function="H" pad="PA27"/>
              <signal group="IO" index="0" function="H" pad="PA30"/>
              <signal group="IO" index="1" function="H" pad="PB15"/>
              <signal group="IO" index="1" function="H" pad="PB23"/>
              <signal group="IO" index="1" function="H" pad="PA15"/>
              <signal group="IO" index="2" function="H" pad="PB16"/>
              <signal group="IO" index="2" function="H" pad="PA16"/>
              <signal group="IO" index="3" function="H" pad="PA17"/>
              <signal group="IO" index="3" function="H" pad="PB17"/>
              <signal group="IO" index="4" function="H" pad="PA10"/>
              <signal group="IO" index="4" function="H" pad="PA20"/>
            </signals>
            <parameters>
              <param name="GENDIV_BITS" value="16"/>
              <param name="GEN_BITS" value="3"/>
              <param name="GEN_NUM" value="5" caption="Number of Generic Clock Generators"/>
              <param name="GEN_NUM_MSB" value="4" caption="Number of Generic Clock Generators - 1"/>
              <param name="GEN_SOURCE_NUM_MSB" value="7" caption="Number of Generic Clock Sources - 1"/>
              <param name="NUM" value="30" caption="Number of Generic Clock Users"/>
              <param name="SOURCE_BITS" value="3"/>
              <param name="SOURCE_DFLL48M" value="6"/>
              <param name="SOURCE_DPLL96M" value="7"/>
              <param name="SOURCE_GCLKGEN1" value="2"/>
              <param name="SOURCE_GCLKIN" value="1"/>
              <param name="SOURCE_NUM" value="8" caption="Number of Generic Clock Sources"/>
              <param name="SOURCE_OSCULP32K" value="3"/>
              <param name="SOURCE_OSC16M" value="5"/>
              <param name="SOURCE_XOSC" value="0"/>
              <param name="SOURCE_XOSC32K" value="4"/>
              <param name="INSTANCE_ID" value="7"/>
            </parameters>
          </instance>
        </module>
        <module name="MCLK" id="U2234" version="2.1.0">
          <instance name="MCLK">
            <register-group name="MCLK" name-in-module="MCLK" address-space="base" offset="0x40000800"/>
            <parameters>
              <param name="BUPDIV_IMPLEMENTED" value="1"/>
              <param name="CTRLA_MCSEL_GCLK" value="1"/>
              <param name="CTRLA_MCSEL_OSC8M" value="0"/>
              <param name="MCLK_CLK_APB_NUM" value="3"/>
              <param name="SYSTEM_CLOCK" value="1000000" caption="System Clock Frequency at Reset"/>
              <param name="INSTANCE_ID" value="2"/>
            </parameters>
            <clock-groups>
              <clock-group name="AHB" grouporder="0">
                <clock name="HPB0" bit="0"/>
                <clock name="HPB1" bit="1"/>
                <clock name="HPB2" bit="2"/>
                <clock name="DMAC" bit="3"/>
                <clock name="USB" bit="4"/>
                <clock name="DSU" bit="5"/>
                <clock name="PAC" bit="7"/>
                <clock name="NVMCTRL" bit="8"/>
                <clock name="HSRAM" bit="9"/>
                <clock name="NVMCTRL_PICACHU" bit="10"/>
              </clock-group>
            </clock-groups>
          </instance>
        </module>
        <module name="MTB" id="U2002" version="1.0.0">
          <instance name="MTB">
            <register-group name="MTB" name-in-module="MTB" address-space="base" offset="0x4100A000"/>
            <parameters>
              <param name="INSTANCE_ID" value="37"/>
            </parameters>
          </instance>
        </module>
        <module name="NVMCTRL" id="U2207" version="3.0.2">
          <instance name="NVMCTRL">
            <register-group name="NVMCTRL" name-in-module="NVMCTRL" address-space="base" offset="0x41004000"/>
            <signals>
              <signal group="MARGIN" function="default" pad="VMARGIN"/>
            </signals>
            <parameters>
              <param name="FACTORY_WORD_IMPLEMENTED_MASK" value="0XC0000007FFFFFFFF"/>
              <param name="GCLK_ID" value="29" caption="Index of Generic Clock for test"/>
              <param name="PMSB" value="3"/>
              <param name="PSZ_BITS" value="6"/>
              <param name="USER_PAGE_OFFSET" value="0x00800000"/>
              <param name="USER_WORD_IMPLEMENTED_MASK" value="0XC01FFFFFFFFFFFFF"/>
              <param name="RWWEE_PAGES" value="128"/>
              <param name="RWWEE_ROW_SIZE" value="256"/>
              <param name="RWW_EEPROM_ADDR" value="0x00400000" caption="Start address of the WWR EEPROM area"/>
              <param name="RWW_EEPROM_SIZE" value="4096" caption="Byte size of the WWR EEPROM area"/>
              <param name="FLASH_SIZE" value="131072"/>
              <param name="PAGE_SIZE" value="64"/>
              <param name="PAGES" value="2048"/>
              <param name="PAGES_PR_REGION" value="128"/>
              <param name="ROW_SIZE" value="256"/>
              <!--  From Datasheet section "Electrical Characteristics","Flash Characteristics" table "Maximum operating Frequency" -->
              <param name="PSM_0_FRMFW_FWS_1_MAX_FREQ" value="12000000"/>
              <param name="PSM_0_FRMLP_FWS_0_MAX_FREQ" value="18000000"/>
              <param name="PSM_0_FRMLP_FWS_1_MAX_FREQ" value="36000000"/>
              <param name="PSM_0_FRMHS_FWS_0_MAX_FREQ" value="25000000"/>
              <param name="PSM_0_FRMHS_FWS_1_MAX_FREQ" value="50000000"/>
              <param name="PSM_1_FRMFW_FWS_1_MAX_FREQ" value="12000000"/>
              <param name="PSM_1_FRMLP_FWS_0_MAX_FREQ" value="8000000"/>
              <param name="PSM_1_FRMLP_FWS_1_MAX_FREQ" value="12000000"/>
              <param name="INSTANCE_ID" value="34"/>
            </parameters>
          </instance>
        </module>
