Microchip-MPLAB-Harmony/dev_packs/Microchip/SAML22_DFP/3.4.59/atdf/ATSAML22J17A.atdf
        <module name="PTC" id="U2215" version="4.0.1">
          <instance name="PTC">
            <register-group name="PTC" name-in-module="PTC" address-space="base" offset="0x42003800"/>
            <signals>
              <signal group="X" index="24" function="B" pad="PA04"/>
              <signal group="X" index="25" function="B" pad="PA05"/>
              <signal group="X" index="26" function="B" pad="PA06"/>
              <signal group="X" index="27" function="B" pad="PA07"/>
              <signal group="X" index="28" function="B" pad="PA16"/>
              <signal group="X" index="29" function="B" pad="PA17"/>
              <signal group="X" index="30" function="B" pad="PA18"/>
              <signal group="X" index="31" function="B" pad="PA19"/>
              <signal group="X" index="0" function="B" pad="PA11"/>
              <signal group="Y" index="0" function="B" pad="PA11"/>
              <signal group="X" index="1" function="B" pad="PA10"/>
              <signal group="Y" index="1" function="B" pad="PA10"/>
              <signal group="X" index="2" function="B" pad="PA09"/>
              <signal group="Y" index="2" function="B" pad="PA09"/>
              <signal group="X" index="3" function="B" pad="PA08"/>
              <signal group="Y" index="3" function="B" pad="PA08"/>
              <signal group="X" index="8" function="B" pad="PA02"/>
              <signal group="Y" index="8" function="B" pad="PA02"/>
              <signal group="X" index="9" function="B" pad="PA03"/>
              <signal group="Y" index="9" function="B" pad="PA03"/>
              <signal group="X" index="10" function="B" pad="PB04"/>
              <signal group="Y" index="10" function="B" pad="PB04"/>
              <signal group="X" index="11" function="B" pad="PB05"/>
              <signal group="Y" index="11" function="B" pad="PB05"/>
              <signal group="X" index="12" function="B" pad="PB06"/>
              <signal group="Y" index="12" function="B" pad="PB06"/>
              <signal group="X" index="13" function="B" pad="PB07"/>
              <signal group="Y" index="13" function="B" pad="PB07"/>
              <signal group="X" index="14" function="B" pad="PB08"/>
              <signal group="Y" index="14" function="B" pad="PB08"/>
              <signal group="X" index="15" function="B" pad="PB09"/>
              <signal group="Y" index="15" function="B" pad="PB09"/>
              <signal group="X" index="16" function="B" pad="PA20"/>
              <signal group="Y" index="16" function="B" pad="PA20"/>
              <signal group="X" index="17" function="B" pad="PA21"/>
              <signal group="Y" index="17" function="B" pad="PA21"/>
              <signal group="X" index="18" function="B" pad="PA22"/>
              <signal group="Y" index="18" function="B" pad="PA22"/>
              <signal group="X" index="19" function="B" pad="PA23"/>
              <signal group="Y" index="19" function="B" pad="PA23"/>
              <signal group="X" index="21" function="B" pad="PA27"/>
              <signal group="Y" index="21" function="B" pad="PA27"/>
              <signal group="X" index="22" function="B" pad="PA30"/>
              <signal group="Y" index="22" function="B" pad="PA30"/>
              <signal group="X" index="23" function="B" pad="PA31"/>
              <signal group="Y" index="23" function="B" pad="PA31"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_EOC" value="37" caption="Index of DMA EOC trigger"/>
              <param name="DMAC_ID_SEQ" value="38" caption="Index of DMA SEQ trigger"/>
              <param name="DMAC_ID_WCOMP" value="39" caption="Index of DMA WCOMP trigger"/>
              <param name="GCLK_ID" value="27" caption="Index of Generic Clock"/>
              <param name="LINES_MSB" value="31"/>
              <param name="LINES_NUM" value="32" caption="Number of PTC lines"/>
              <param name="Y_LINES_MSB" value="23"/>
              <param name="Y_LINES_NUM" value="24" caption="Number of Y lines"/>
              <param name="INSTANCE_ID" value="78"/>
            </parameters>
          </instance>
        </module>
        <module name="RSTC" id="U2239" version="3.0.0">
          <instance name="RSTC">
            <register-group name="RSTC" name-in-module="RSTC" address-space="base" offset="0x40000C00"/>
            <parameters>
              <param name="BACKUP_IMPLEMENTED" value="1"/>
              <param name="NUMBER_OF_EXTWAKE" value="0" caption="number of external wakeup line"/>
              <param name="INSTANCE_ID" value="3"/>
            </parameters>
          </instance>
        </module>
        <module name="RTC" id="U2250" version="2.0.1">
          <instance name="RTC">
            <register-group name="RTC" name-in-module="RTC" address-space="base" offset="0x40002400"/>
            <signals>
              <signal group="IN" index="0" function="G" pad="PB00"/>
              <signal group="IN" index="1" function="G" pad="PB02"/>
              <signal group="IN" index="2" function="G" pad="PA02"/>
              <signal group="IN" index="2" function="F" pad="PB01"/>
              <signal group="OUT" function="G" pad="PB01"/>
            </signals>
            <parameters>
              <param name="ALARM_NUM" value="1" caption="Number of Alarms"/>
              <param name="BKUP_NUM" value="8" caption="Number of Backup Registers"/>
              <param name="COMP16_NUM" value="2" caption="Number of 16-bit Comparators"/>
              <param name="COMP32_NUM" value="1" caption="Number of 32-bit Comparators"/>
              <param name="DMAC_ID_TIMESTAMP" value="1" caption="DMA RTC timestamp trigger"/>
              <param name="GPR_NUM" value="2" caption="Number of General-Purpose Registers"/>
              <param name="PER_NUM" value="8" caption="Number of Periodic Intervals"/>
              <param name="TAMPER_NUM" value="5" caption="Number of Tamper Inputs"/>
              <param name="INSTANCE_ID" value="9"/>
            </parameters>
          </instance>
        </module>
        <module name="SERCOM" id="U2201" version="4.0.0">
          <instance name="SERCOM0">
            <register-group name="SERCOM0" name-in-module="SERCOM" address-space="base" offset="0x42000400"/>
            <signals>
              <signal group="PAD" index="0" function="D" pad="PA04"/>
              <signal group="PAD" index="0" function="C" pad="PA08"/>
              <signal group="PAD" index="0" function="C" pad="PA20"/>
              <signal group="PAD" index="1" function="D" pad="PA05"/>
              <signal group="PAD" index="1" function="C" pad="PA09"/>
              <signal group="PAD" index="1" function="C" pad="PA21"/>
              <signal group="PAD" index="2" function="D" pad="PA06"/>
              <signal group="PAD" index="2" function="C" pad="PA10"/>
              <signal group="PAD" index="2" function="C" pad="PA22"/>
              <signal group="PAD" index="2" function="C" pad="PB22"/>
              <signal group="PAD" index="3" function="D" pad="PA07"/>
              <signal group="PAD" index="3" function="C" pad="PA11"/>
              <signal group="PAD" index="3" function="C" pad="PA23"/>
              <signal group="PAD" index="3" function="C" pad="PB23"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_RX" value="2" caption="Index of DMA RX trigger"/>
              <param name="DMAC_ID_TX" value="3" caption="Index of DMA TX trigger"/>
              <param name="GCLK_ID_CORE" value="16"/>
              <param name="GCLK_ID_SLOW" value="15"/>
              <param name="INT_MSB" value="6"/>
              <param name="PMSB" value="3"/>
              <param name="SPI" value="1" caption="SPI mode implemented?"/>
              <param name="TWIM" value="0" caption="TWI Master mode implemented?"/>
              <param name="TWIS" value="0" caption="TWI Slave mode implemented?"/>
              <param name="TWI_HSMODE" value="0" caption="TWI HighSpeed mode implemented?"/>
              <param name="USART" value="1" caption="USART mode implemented?"/>
              <param name="USART_ISO7816" value="1" caption="USART ISO7816 mode implemented?"/>
              <param name="USART_LIN_MASTER" value="0" caption="USART LIN Master mode implemented?"/>
              <param name="USART_RS485" value="1" caption="USART RS485 mode implemented?"/>
              <param name="INSTANCE_ID" value="65"/>
            </parameters>
          </instance>
          <instance name="SERCOM1">
            <register-group name="SERCOM1" name-in-module="SERCOM" address-space="base" offset="0x42000800"/>
            <signals>
              <signal group="PAD" index="0" function="C" pad="PB30"/>
              <signal group="PAD" index="0" function="D" pad="PA00"/>
              <signal group="PAD" index="0" function="C" pad="PA16"/>
              <signal group="PAD" index="1" function="C" pad="PB31"/>
              <signal group="PAD" index="1" function="D" pad="PA01"/>
              <signal group="PAD" index="1" function="C" pad="PA17"/>
              <signal group="PAD" index="2" function="D" pad="PA30"/>
              <signal group="PAD" index="2" function="C" pad="PA18"/>
              <signal group="PAD" index="3" function="D" pad="PA31"/>
              <signal group="PAD" index="3" function="C" pad="PA19"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_RX" value="4" caption="Index of DMA RX trigger"/>
              <param name="DMAC_ID_TX" value="5" caption="Index of DMA TX trigger"/>
              <param name="GCLK_ID_CORE" value="17"/>
              <param name="GCLK_ID_SLOW" value="15"/>
              <param name="INT_MSB" value="6"/>
              <param name="PMSB" value="3"/>
              <param name="SPI" value="1" caption="SPI mode implemented?"/>
              <param name="TWIM" value="1" caption="TWI Master mode implemented?"/>
              <param name="TWIS" value="1" caption="TWI Slave mode implemented?"/>
              <param name="TWI_HSMODE" value="1" caption="TWI HighSpeed mode implemented?"/>
              <param name="USART" value="1" caption="USART mode implemented?"/>
              <param name="USART_ISO7816" value="1" caption="USART ISO7816 mode implemented?"/>
              <param name="USART_LIN_MASTER" value="0" caption="USART LIN Master mode implemented?"/>
              <param name="USART_RS485" value="1" caption="USART RS485 mode implemented?"/>
              <param name="INSTANCE_ID" value="66"/>
            </parameters>
          </instance>
