Microchip-MPLAB-Harmony/dev_packs/Microchip/SAML22_DFP/3.4.59/atdf/ATSAML22J17A.atdf
          <instance name="SERCOM2">
            <register-group name="SERCOM2" name-in-module="SERCOM" address-space="base" offset="0x42000C00"/>
            <signals>
              <signal group="PAD" index="0" function="D" pad="PA22"/>
              <signal group="PAD" index="0" function="D" pad="PA16"/>
              <signal group="PAD" index="1" function="D" pad="PA23"/>
              <signal group="PAD" index="1" function="D" pad="PA17"/>
              <signal group="PAD" index="2" function="D" pad="PA18"/>
              <signal group="PAD" index="2" function="D" pad="PA20"/>
              <signal group="PAD" index="2" function="C" pad="PA24"/>
              <signal group="PAD" index="3" function="D" pad="PA19"/>
              <signal group="PAD" index="3" function="D" pad="PA21"/>
              <signal group="PAD" index="3" function="C" pad="PA25"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_RX" value="6" caption="Index of DMA RX trigger"/>
              <param name="DMAC_ID_TX" value="7" caption="Index of DMA TX trigger"/>
              <param name="GCLK_ID_CORE" value="18"/>
              <param name="GCLK_ID_SLOW" value="15"/>
              <param name="INT_MSB" value="6"/>
              <param name="PMSB" value="3"/>
              <param name="SPI" value="1" caption="SPI mode implemented?"/>
              <param name="TWIM" value="1" caption="TWI Master mode implemented?"/>
              <param name="TWIS" value="1" caption="TWI Slave mode implemented?"/>
              <param name="TWI_HSMODE" value="0" caption="TWI HighSpeed mode implemented?"/>
              <param name="USART" value="1" caption="USART mode implemented?"/>
              <param name="USART_ISO7816" value="1" caption="USART ISO7816 mode implemented?"/>
              <param name="USART_LIN_MASTER" value="0" caption="USART LIN Master mode implemented?"/>
              <param name="USART_RS485" value="1" caption="USART RS485 mode implemented?"/>
              <param name="INSTANCE_ID" value="67"/>
            </parameters>
          </instance>
          <instance name="SERCOM3">
            <register-group name="SERCOM3" name-in-module="SERCOM" address-space="base" offset="0x42001000"/>
            <signals>
              <signal group="PAD" index="0" function="C" pad="PB12"/>
              <signal group="PAD" index="0" function="D" pad="PA12"/>
              <signal group="PAD" index="0" function="D" pad="PB08"/>
              <signal group="PAD" index="0" function="C" pad="PB02"/>
              <signal group="PAD" index="1" function="C" pad="PB13"/>
              <signal group="PAD" index="1" function="D" pad="PA13"/>
              <signal group="PAD" index="1" function="D" pad="PB09"/>
              <signal group="PAD" index="1" function="C" pad="PB03"/>
              <signal group="PAD" index="2" function="C" pad="PB14"/>
              <signal group="PAD" index="2" function="D" pad="PA14"/>
              <signal group="PAD" index="2" function="C" pad="PB00"/>
              <signal group="PAD" index="3" function="C" pad="PB15"/>
              <signal group="PAD" index="3" function="D" pad="PA15"/>
              <signal group="PAD" index="3" function="D" pad="PB11"/>
              <signal group="PAD" index="3" function="C" pad="PB01"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_RX" value="8" caption="Index of DMA RX trigger"/>
              <param name="DMAC_ID_TX" value="9" caption="Index of DMA TX trigger"/>
              <param name="GCLK_ID_CORE" value="19"/>
              <param name="GCLK_ID_SLOW" value="15"/>
              <param name="INT_MSB" value="6"/>
              <param name="PMSB" value="3"/>
              <param name="SPI" value="1" caption="SPI mode implemented?"/>
              <param name="TWIM" value="1" caption="TWI Master mode implemented?"/>
              <param name="TWIS" value="1" caption="TWI Slave mode implemented?"/>
              <param name="TWI_HSMODE" value="0" caption="TWI HighSpeed mode implemented?"/>
              <param name="USART" value="1" caption="USART mode implemented?"/>
              <param name="USART_ISO7816" value="1" caption="USART ISO7816 mode implemented?"/>
              <param name="USART_LIN_MASTER" value="0" caption="USART LIN Master mode implemented?"/>
              <param name="USART_RS485" value="1" caption="USART RS485 mode implemented?"/>
              <param name="INSTANCE_ID" value="68"/>
            </parameters>
          </instance>
        </module>
        <module name="SLCD" id="U2264" version="1.0.0">
          <instance name="SLCD">
            <register-group name="SLCD" name-in-module="SLCD" address-space="base" offset="0x42003C00"/>
            <signals>
              <signal group="LP" index="0" function="B" pad="PB06"/>
              <signal group="LP" index="1" function="B" pad="PB07"/>
              <signal group="LP" index="2" function="B" pad="PB08"/>
              <signal group="LP" index="3" function="B" pad="PB09"/>
              <signal group="LP" index="4" function="B" pad="PA04"/>
              <signal group="LP" index="5" function="B" pad="PA05"/>
              <signal group="LP" index="6" function="B" pad="PA06"/>
              <signal group="LP" index="7" function="B" pad="PA07"/>
              <signal group="LP" index="11" function="B" pad="PA08"/>
              <signal group="LP" index="12" function="B" pad="PA09"/>
              <signal group="LP" index="13" function="B" pad="PA10"/>
              <signal group="LP" index="14" function="B" pad="PA11"/>
              <signal group="LP" index="21" function="B" pad="PB11"/>
              <signal group="LP" index="22" function="B" pad="PB12"/>
              <signal group="LP" index="23" function="B" pad="PB13"/>
              <signal group="LP" index="24" function="B" pad="PB14"/>
              <signal group="LP" index="25" function="B" pad="PB15"/>
              <signal group="LP" index="28" function="B" pad="PA12"/>
              <signal group="LP" index="29" function="B" pad="PA13"/>
              <signal group="LP" index="30" function="B" pad="PA14"/>
              <signal group="LP" index="31" function="B" pad="PA15"/>
              <signal group="LP" index="32" function="B" pad="PA16"/>
              <signal group="LP" index="33" function="B" pad="PA17"/>
              <signal group="LP" index="34" function="B" pad="PA18"/>
              <signal group="LP" index="35" function="B" pad="PA19"/>
              <signal group="LP" index="42" function="B" pad="PB16"/>
              <signal group="LP" index="43" function="B" pad="PB17"/>
              <signal group="LP" index="48" function="B" pad="PA20"/>
              <signal group="LP" index="49" function="B" pad="PA21"/>
              <signal group="LP" index="50" function="B" pad="PA22"/>
              <signal group="LP" index="51" function="B" pad="PA23"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_ABMDRDY" value="34"/>
              <param name="DMAC_ID_ACMDRDY" value="33"/>
              <param name="DMAC_ID_DMU" value="32"/>
              <param name="MAX_COM" value="8" caption="Max number of COM lines (4 or 8)"/>
              <param name="MAX_SEG" value="44" caption="Max number of SEG lines (24 or 44)"/>
              <param name="NB_LP" value="52" caption="Number of LCD pins ([28..64] or [48..64])"/>
              <param name="INSTANCE_ID" value="79"/>
            </parameters>
          </instance>
        </module>
        <module name="SUPC" id="U2117" version="3.0.0">
          <instance name="SUPC">
            <register-group name="SUPC" name-in-module="SUPC" address-space="base" offset="0x40001800"/>
            <signals>
              <signal group="OUT" index="0" function="H" pad="PB01"/>
              <signal group="OUT" index="1" function="H" pad="PB02"/>
              <signal group="PSOK" function="H" pad="PB00"/>
              <signal group="VBAT" function="H" pad="PB03"/>
            </signals>
            <parameters>
              <param name="BOD12_CALIB_MSB" value="5"/>
              <param name="BOD33_CALIB_MSB" value="5"/>
              <param name="OUT_NUM_MSB" value="1" caption="MSB of backup output pad Number"/>
              <param name="HAS_VMON_BIT" value="1" caption="VMON bit is present"/>
              <param name="HAS_RUNBKUP_BIT" value="1" caption="RUNBKUP bit is present"/>
              <param name="HAS_STDBYPL0_BIT" value="1" caption="STDBYPL0 bit is present"/>
              <param name="HAS_LPEFF_BIT" value="1" caption="LPEFF bit is present"/>
              <param name="HAS_SEL_BIT" value="1" caption="SEL bit is present"/>
              <param name="HAS_BOD33_REG_NAME" value="1" caption="Name of BOD register is BOD33"/>
              <param name="HAS_NO_TSEN" value="1" caption="SUPC does not have TSEN"/>
              <param name="INSTANCE_ID" value="6"/>
            </parameters>
          </instance>
        </module>
        <module name="TC" id="U2249" version="2.0.0">
          <instance name="TC0">
            <register-group name="TC0" name-in-module="TC" address-space="base" offset="0x42002000"/>
            <signals>
              <signal group="WO" index="0" function="E" pad="PA22"/>
              <signal group="WO" index="0" function="E" pad="PB08"/>
              <signal group="WO" index="0" function="E" pad="PB12"/>
              <signal group="WO" index="1" function="E" pad="PA23"/>
              <signal group="WO" index="1" function="E" pad="PB09"/>
              <signal group="WO" index="1" function="E" pad="PB13"/>
            </signals>
            <parameters>
              <param name="CC_NUM" value="2"/>
              <param name="DMAC_ID_OVF" value="19" caption="Indexes of DMA Overflow trigger"/>
              <param name="DMAC_ID_MC0" value="20" caption="Indexes of DMA Match/Compare 0 trigger"/>
              <param name="DMAC_ID_MC1" value="21" caption="Indexes of DMA Match/Compare 1 trigger"/>
              <param name="EXT" value="0"/>
              <param name="GCLK_ID" value="23"/>
              <param name="MASTER_SLAVE_MODE" value="1" caption="TC type 1 : Master, 2 : Slave"/>
              <param name="OW_NUM" value="2"/>
              <param name="INSTANCE_ID" value="72"/>
            </parameters>
          </instance>
          <instance name="TC1">
            <register-group name="TC1" name-in-module="TC" address-space="base" offset="0x42002400"/>
            <signals>
              <signal group="WO" index="0" function="E" pad="PA24"/>
              <signal group="WO" index="0" function="E" pad="PB14"/>
              <signal group="WO" index="1" function="E" pad="PA25"/>
              <signal group="WO" index="1" function="E" pad="PB11"/>
              <signal group="WO" index="1" function="E" pad="PB15"/>
            </signals>
            <parameters>
              <param name="CC_NUM" value="2"/>
              <param name="DMAC_ID_OVF" value="22" caption="Indexes of DMA Overflow trigger"/>
              <param name="DMAC_ID_MC0" value="23" caption="Indexes of DMA Match/Compare 0 trigger"/>
              <param name="DMAC_ID_MC1" value="24" caption="Indexes of DMA Match/Compare 1 trigger"/>
              <param name="EXT" value="0"/>
              <param name="GCLK_ID" value="23"/>
              <param name="MASTER_SLAVE_MODE" value="2" caption="TC type 1 : Master, 2 : Slave"/>
              <param name="OW_NUM" value="2"/>
              <param name="INSTANCE_ID" value="73"/>
            </parameters>
          </instance>
          <instance name="TC2">
            <register-group name="TC2" name-in-module="TC" address-space="base" offset="0x42002800"/>
            <signals>
              <signal group="WO" index="0" function="E" pad="PB02"/>
              <signal group="WO" index="0" function="E" pad="PB16"/>
              <signal group="WO" index="1" function="E" pad="PB03"/>
              <signal group="WO" index="1" function="E" pad="PB17"/>
            </signals>
            <parameters>
              <param name="CC_NUM" value="2"/>
              <param name="DMAC_ID_OVF" value="25" caption="Indexes of DMA Overflow trigger"/>
              <param name="DMAC_ID_MC0" value="26" caption="Indexes of DMA Match/Compare 0 trigger"/>
              <param name="DMAC_ID_MC1" value="27" caption="Indexes of DMA Match/Compare 1 trigger"/>
              <param name="EXT" value="0"/>
              <param name="GCLK_ID" value="24"/>
              <param name="MASTER_SLAVE_MODE" value="1" caption="TC type 1 : Master, 2 : Slave"/>
              <param name="OW_NUM" value="2"/>
              <param name="INSTANCE_ID" value="74"/>
            </parameters>
          </instance>
          <instance name="TC3">
            <register-group name="TC3" name-in-module="TC" address-space="base" offset="0x42002C00"/>
            <signals>
              <signal group="WO" index="0" function="E" pad="PA20"/>
              <signal group="WO" index="0" function="E" pad="PB00"/>
              <signal group="WO" index="0" function="E" pad="PB22"/>
              <signal group="WO" index="1" function="E" pad="PA21"/>
              <signal group="WO" index="1" function="E" pad="PB01"/>
              <signal group="WO" index="1" function="E" pad="PB23"/>
            </signals>
            <parameters>
              <param name="CC_NUM" value="2"/>
              <param name="DMAC_ID_OVF" value="28" caption="Indexes of DMA Overflow trigger"/>
              <param name="DMAC_ID_MC0" value="29" caption="Indexes of DMA Match/Compare 0 trigger"/>
              <param name="DMAC_ID_MC1" value="30" caption="Indexes of DMA Match/Compare 1 trigger"/>
              <param name="EXT" value="0"/>
              <param name="GCLK_ID" value="24"/>
              <param name="MASTER_SLAVE_MODE" value="2" caption="TC type 1 : Master, 2 : Slave"/>
              <param name="OW_NUM" value="2"/>
              <param name="INSTANCE_ID" value="75"/>
            </parameters>
          </instance>
        </module>
        <module name="TCC" id="U2213" version="3.0.0">
          <instance name="TCC0">
            <register-group name="TCC0" name-in-module="TCC" address-space="base" offset="0x42001C00"/>
            <signals>
              <signal group="WO" index="0" function="F" pad="PA24"/>
              <signal group="WO" index="0" function="E" pad="PA04"/>
              <signal group="WO" index="0" function="E" pad="PA08"/>
              <signal group="WO" index="0" function="E" pad="PB30"/>
              <signal group="WO" index="1" function="F" pad="PA25"/>
              <signal group="WO" index="1" function="E" pad="PA05"/>
              <signal group="WO" index="1" function="E" pad="PA09"/>
              <signal group="WO" index="1" function="E" pad="PB31"/>
              <signal group="WO" index="2" function="F" pad="PA10"/>
              <signal group="WO" index="2" function="F" pad="PA18"/>
              <signal group="WO" index="2" function="F" pad="PB22"/>
              <signal group="WO" index="3" function="F" pad="PA11"/>
              <signal group="WO" index="3" function="F" pad="PA19"/>
              <signal group="WO" index="3" function="F" pad="PB23"/>
              <signal group="WO" index="4" function="F" pad="PA22"/>
              <signal group="WO" index="4" function="F" pad="PB16"/>
              <signal group="WO" index="4" function="F" pad="PA14"/>
              <signal group="WO" index="5" function="F" pad="PA15"/>
              <signal group="WO" index="5" function="F" pad="PA23"/>
              <signal group="WO" index="5" function="F" pad="PA27"/>
              <signal group="WO" index="5" function="F" pad="PB11"/>
              <signal group="WO" index="5" function="F" pad="PB17"/>
              <signal group="WO" index="6" function="F" pad="PA12"/>
              <signal group="WO" index="6" function="F" pad="PA16"/>
              <signal group="WO" index="6" function="F" pad="PA20"/>
              <signal group="WO" index="6" function="F" pad="PB12"/>
              <signal group="WO" index="7" function="F" pad="PA13"/>
              <signal group="WO" index="7" function="F" pad="PA17"/>
              <signal group="WO" index="7" function="F" pad="PA21"/>
              <signal group="WO" index="7" function="F" pad="PB13"/>
            </signals>
            <parameters>
              <param name="CC_NUM" value="4" caption="Number of Compare/Capture units"/>
              <param name="DITHERING" value="1" caption="Dithering feature implemented"/>
              <param name="DMAC_ID_OVF" value="14" caption="DMA overflow/underflow/retrigger trigger"/>
              <param name="DMAC_ID_MC0" value="15" caption="Indexes of DMA Match/Compare 0 trigger"/>
              <param name="DMAC_ID_MC1" value="16" caption="Indexes of DMA Match/Compare 1 trigger"/>
              <param name="DMAC_ID_MC2" value="17" caption="Indexes of DMA Match/Compare 2 trigger"/>
              <param name="DMAC_ID_MC3" value="18" caption="Indexes of DMA Match/Compare 3 trigger"/>
              <param name="DTI" value="1" caption="Dead-Time-Insertion feature implemented"/>
              <param name="EXT" value="31" caption="Coding of implemented extended features"/>
              <param name="GCLK_ID" value="22" caption="Index of Generic Clock"/>
              <param name="OTMX" value="1" caption="Output Matrix feature implemented"/>
              <param name="OW_NUM" value="8" caption="Number of Output Waveforms"/>
              <param name="PG" value="1" caption="Pattern Generation feature implemented"/>
              <param name="SIZE" value="24"/>
              <param name="SWAP" value="1" caption="DTI outputs swap feature implemented"/>
              <param name="TYPE" value="0" caption="TCC type 0 : NA, 1 : Master, 2 : Slave"/>
              <param name="INSTANCE_ID" value="71"/>
            </parameters>
          </instance>
        </module>
