Microchip-MPLAB-Harmony/dev_packs/Microchip/SAML22_DFP/3.4.59/atdf/ATSAML22J17A.atdf
        <register name="CTRLD" offset="0x8" rw="RW" access="WSYNC" size="1" initval="0x80" caption="Control D">
          <bitfield name="BLANK" caption="Blank LCD" mask="0x1"/>
          <bitfield name="BLINK" caption="Blinking Enable" mask="0x2"/>
          <bitfield name="CSREN" caption="Circular Shift Register Enable" mask="0x4"/>
          <bitfield name="FC0EN" caption="Frame Counter 0 Enable" mask="0x10"/>
          <bitfield name="FC1EN" caption="Frame Counter 1 Enable" mask="0x20"/>
          <bitfield name="FC2EN" caption="Frame Counter 2 Enable" mask="0x40"/>
          <bitfield name="DISPEN" caption="Display enable" mask="0x80"/>
        </register>
        <register name="EVCTRL" offset="0xC" rw="RW" size="1" initval="0x00" caption="Event Control">
          <bitfield name="FC0OEO" caption="Frame Counter 0 Overflow Event Output Enable" mask="0x1"/>
          <bitfield name="FC1OEO" caption="Frame Counter 1 Overflow Event Output Enable" mask="0x2"/>
          <bitfield name="FC2OEO" caption="Frame Counter 2 Overflow Event Output Enable" mask="0x4"/>
        </register>
        <register name="INTENCLR" offset="0xD" rw="RW" size="1" atomic-op="clear:INTENCLR" initval="0x00" caption="Interrupt Enable Clear">
          <bitfield name="FC0O" caption="Frame Counter 0 Overflow Interrupt Disable" mask="0x1"/>
          <bitfield name="FC1O" caption="Frame Counter 1 Overflow Interrupt Disable" mask="0x2"/>
          <bitfield name="FC2O" caption="Frame Counter 2 Overflow Interrupt Disable" mask="0x4"/>
          <bitfield name="VLCDRT" caption="VLCD Ready Toggle Interrupt Disable" mask="0x8"/>
          <bitfield name="VLCDST" caption="VLCD Status Toggle Interrupt Disable" mask="0x10"/>
          <bitfield name="PRST" caption="Pump Run Status Toggle Interrupt Disable" mask="0x20"/>
        </register>
        <register name="INTENSET" offset="0xE" rw="RW" size="1" atomic-op="set:INTENSET" initval="0x00" caption="Interrupt Enable Set">
          <bitfield name="FC0O" caption="Frame Counter 0 Overflow Interrupt Enable" mask="0x1"/>
          <bitfield name="FC1O" caption="Frame Counter 1 Overflow Interrupt Enable" mask="0x2"/>
          <bitfield name="FC2O" caption="Frame Counter 2 Overflow Interrupt Enable" mask="0x4"/>
          <bitfield name="VLCDRT" caption="VLCD Ready Toggle Interrupt Enable" mask="0x8"/>
          <bitfield name="VLCDST" caption="VLCD Status Toggle Interrupt Enable" mask="0x10"/>
          <bitfield name="PRST" caption="Pump Run Status Toggle Interrupt Enable" mask="0x20"/>
        </register>
        <register name="INTFLAG" offset="0xF" rw="RW" size="1" atomic-op="clear:INTFLAG" initval="0x00" caption="Interrupt Flag Status and Clear">
          <bitfield name="FC0O" caption="Frame Counter 0 Overflow" mask="0x1"/>
          <bitfield name="FC1O" caption="Frame Counter 1 Overflow" mask="0x2"/>
          <bitfield name="FC2O" caption="Frame Counter 2 Overflow" mask="0x4"/>
          <bitfield name="VLCDRT" caption="VLCD Ready Toggle" mask="0x8"/>
          <bitfield name="VLCDST" caption="VLCD Status Toggle" mask="0x10"/>
          <bitfield name="PRST" caption="Pump Run Status Toggle" mask="0x20"/>
        </register>
        <register name="STATUS" offset="0x10" rw="R" size="1" initval="0x00" caption="Status">
          <bitfield name="VLCDR" caption="VLCD Ready" mask="0x1"/>
          <bitfield name="PRUN" caption="LCD Charge Pump is Running" mask="0x2"/>
          <bitfield name="VLCDS" caption="VLCD Status" mask="0x4"/>
          <bitfield name="CMWRBUSY" caption="Character mapping write busy" mask="0x8"/>
          <bitfield name="ACMBUSY" caption="ACM state machine busy" mask="0x10"/>
          <bitfield name="ABMBUSY" caption="ABM state machine busy" mask="0x20"/>
        </register>
        <register name="SYNCBUSY" offset="0x14" rw="R" size="4" initval="0x00000000" caption="Synchronization Busy">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="CTRLD" caption="Control D" mask="0x4"/>
        </register>
        <register name="FC0" offset="0x18" rw="RW" size="1" initval="0x00" caption="Frame Counter 0 Configuration">
          <bitfield name="OVF" caption="Frame Counter Overflow Value" mask="0x1F"/>
          <bitfield name="PB" caption="Prescaler Bypass" mask="0x80"/>
        </register>
        <register name="FC1" offset="0x19" rw="RW" size="1" initval="0x00" caption="Frame Counter 1 Configuration">
          <bitfield name="OVF" caption="Frame Counter Overflow Value" mask="0x1F"/>
          <bitfield name="PB" caption="Prescaler Bypass" mask="0x80"/>
        </register>
        <register name="FC2" offset="0x1A" rw="RW" size="1" initval="0x00" caption="Frame Counter 2 Configuration">
          <bitfield name="OVF" caption="Frame Counter Overflow Value" mask="0x1F"/>
          <bitfield name="PB" caption="Prescaler Bypass" mask="0x80"/>
        </register>
        <register name="LPENL" offset="0x1C" rw="RW" size="4" initval="0x00000000" caption="LCD Pin Enable Low">
          <bitfield name="LPEN" caption="LCD Pin Enable" mask="0xFFFFFFFF"/>
        </register>
        <register name="LPENH" offset="0x20" rw="RW" size="4" initval="0x00000000" caption="LCD Pin Enable High">
          <bitfield name="LPEN" caption="LCD Pin Enable" mask="0xFFFFF"/>
        </register>
        <register name="SDATAL0" offset="0x24" rw="RW" size="4" initval="0x00000000" caption="Segments Data Low for COM0 Line">
          <bitfield name="SDATA" caption="Segments Data" mask="0xFFFFFFFF"/>
        </register>
        <register name="SDATAH0" offset="0x28" rw="RW" size="4" initval="0x00000000" caption="Segments Data High for COM0 Line">
          <bitfield name="SDATA" caption="Segments Data" mask="0xFFF"/>
        </register>
        <register name="SDATAL1" offset="0x2C" rw="RW" size="4" initval="0x00000000" caption="Segments Data Low for COM1 Line">
          <bitfield name="SDATA" caption="Segments Data" mask="0xFFFFFFFF"/>
        </register>
        <register name="SDATAH1" offset="0x30" rw="RW" size="4" initval="0x00000000" caption="Segments Data High for COM1 Line">
          <bitfield name="SDATA" caption="Segments Data" mask="0xFFF"/>
        </register>
